Backend/XML_backend/XML_agent/test.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Body>
    <ns0:newRoomRequest xmlns:ns0="http://www.team17.xml.ftn.uns.ac.rs/NewRoom">
      <ns0:room>
        <ns0:address>
          <ns0:country>Serbia</ns0:country>
          <ns0:state>Zlatibor</ns0:state>
          <ns0:city>Zlatibor</ns0:city>
          <ns0:postalCode>31315</ns0:postalCode>
          <ns0:street>Miladina Pe&#263;inara</ns0:street>
          <ns0:streetNumber>26</ns0:streetNumber>
          <ns0:lat>43.7282202</ns0:lat>
          <ns0:lng>19.7050399</ns0:lng>
        </ns0:address>
        <ns0:type>
          <ns0:id>2</ns0:id>
        </ns0:type>
        <ns0:category>
          <ns0:id>6</ns0:id>
        </ns0:category>
        <ns0:defaultPrice>50</ns0:defaultPrice>
        <ns0:numberOfPeople>2</ns0:numberOfPeople>
        <ns0:cancelationDays>10</ns0:cancelationDays>
        <ns0:additionalServices>
          <ns0:id>1</ns0:id>
        </ns0:additionalServices>
        <ns0:additionalServices>
          <ns0:id>13</ns0:id>
        </ns0:additionalServices>
        <ns0:description>Opis sobe.</ns0:description>
        <ns0:floor>1</ns0:floor>
        <ns0:roomNumber>103</ns0:roomNumber>
      </ns0:room>
    </ns0:newRoomRequest>
  </soap-env:Body>
</soap-env:Envelope>
